[
{ "id" : "0",
    "name":"Noreetuh",
   "date":"February 3, 2019",
   "cuisine": "Hawaiian",
   "finalscore": "★ 10/10",
   "address": "128 1st Avenue, New York, NY 10009",
   "ratings":"★★★★★",
   "ratings2":"★★★★★",
   "link":"http://www.noreetuh.com/menu/",
   "type":"restaurant",
   "descriptions": "This place was awesome. I was skeptical at first because I didn't want to overload on pork dishes, but I ended up getting the pork katsu for an appetizer and pork belly tortellini as my starter anyways. I don't even know if that was a mistake, because everything was so good. This place had some of the best pasta I've ever had. A 3 course meal for $42 honestly isn't too bad when you consider the quality of each dish and the generous portions in the appetizer. I had a pork katsu to start, which wasn't anything amazing but was cooked perfectly. The main star of the show was the luau leaf pork belly tortellini in a coconut broth, served with shrimp and clams. For dessert, I shared an upside down pineapple cake served with scoops of vanilla, pineapple, and coconut ice cream."
 },
{"id" : "1",
  "name":"The Halal Guys",
  "date":"February 8, 2019",
  "cuisine": "Middle Eastern",
  "finalscore": "★ 9/10",
  "address": "307 E 14th St, New York, NY 10003",
  "ratings":"★★★★",
  "ratings2":"★★★★★",
  "link":"https://thehalalguys.com/menu/",
  "type":"restaurant",
  "descriptions": "This NYC mainstay has gone global. I've been eating at the Halal Guys food cart from 53rd Street for a while amongst other similar meat over rice options on the streets, but I've never been to the Union Square sit-in location. I wish this location served lamb over rice, but unfortunately they only serve chicken, beef gyro, or a combination of both (they also have falafels, though Mahmoun's Falafel is a better pick for that and is really close by). This is solid Halal Guys food and the decor is nothing special, but let's be honest here, you're here go gorge yourself on cheap street food without actually having to eat on the streets on a cold winter day in Union Square. I will admit, however, that the lettuce and tomatoes they used at this location tasted fresher than what you would usually get elsewhere."
},
{"id" : "2",
 "name":"Enchiladas",
 "date":"February 9, 2019",
 "cuisine": "Mexican",
 "finalscore": "★ 8/10",
 "address": "Homemade Recipe",
 "ratings":"★★★★",
 "ratings2":"★★★★",
 "link":"https://www.allrecipes.com/recipe/229123/best-beef-enchiladas/",
 "type":"recipe",
 "descriptions": "If you're craving some Mexican food, this is going to be some of the heaviest, cheesiest messes of beans, meat, and tortilla around. This recipe took less than an hour to make from start to finish including baking time, and was relatively easy to make. While enchiladas aren't exactly something you would want to eat on a daily basis (at least I wouldn't), this recipe definitely hit the spot and satisfied my Mexican food cravings. It reminded me of my time as a Middle School student eating taquitos out of the freezer, only as a sophisticated adult. I know that comparison doesn't really do this recipe justice, but that's still one of the highest praises I can give to a recipe, because I absolutely loved eating bags of frozen taquitos right after school."
},
{"id" : "3",
"name":"21 Shanghai House",
"date":"February 10, 2019",
"cuisine": "Chinese",
"finalscore": "★ 7/10",
"address": "21 Mott St, New York, NY 10003",
"ratings":"★★★★",
"ratings2":"★★★",
"link":"http://21shanghaihouseny.com/",
"type":"restaurant",
"descriptions": "Sometimes you need to get a fill of Chinese food, whether it's amazing or not. This was your standard Chinatown fare which is perfectly good and dandy, but nothing truly blew me out of the water. We had drunken chicken, rice cakes, potstickers, soup dumplings, and bamboo shoots with pork. The menus are huge and varied as is the case with most Chinese restaurants, so it's only natural for dishes to be hit or miss.<br/> <br/>In our case, the potstickers were too thick and the pork filling wasn't as flavorful as you'd hope. The rice cakes were completely bland and could really have used a kick of soy sauce. As for the rest, the food was great and the atmosphere was busy. That's just how it is when you visit Chinatown for lunch on a weekend, I suppose."
},
{"id" : "4",
 "name":"Karakatta",
 "date":"February 10, 2019",
 "cuisine": "Ramen",
 "finalscore": "★ 6/10",
 "address": "230 Thompson St, New York, NY 10012",
 "ratings":"★★★",
 "ratings2":"★★★",
 "link":"https://karakatta-com.webs.com/menu",
 "type":"restaurant",
 "descriptions": "I'm going to be completely honest when I say that the only reason that you would stop here as opposed to any other of the amazing ramen shops around NYC is if you were playing board games next door at The Uncommons (which is a fucking awesome place by the way). This place serves a solid bowl of ramen nonetheless, and you'll be attracted like flies to a bright light on a cold winter's day because the whole restaurant is a bright red that's reminiscent of an alarm light in a submarine. Their main takeaway is the Spicy Stamina Ginger Ramen which comes with bamboo shoots, bean sprouts, a boatload of ginger, pork belly, and half an egg. The pork belly was delicious, though I would say that it's kind of hard to mess that up in a ramen! The butter miso is also a solid pick, as the butter gives the miso broth a more hearty flavor to your standard miso ramen fare.<br/><br/>This isn't a terrible place by any means. It's just not a place you would go out of your way to visit when there are so many amazing options available (I'm looking at you, Momosan)."
},
{"id" : "5",
 "name":"Kimchi Fried Rice",
 "date":"February 15, 2019",
 "cuisine": "Korean",
 "finalscore": "★ 9/10",
 "address": "Homemade Recipe",
 "ratings":"★★★★",
 "ratings2":"★★★★★",
 "link":"https://omnivorescookbook.com/kimchi-fried-rice/",
 "type":"recipe",
 "descriptions": "Kimchi fried rice is a quick and easy solution to leftovers in the fridge just like any other fried rice recipe. Spam and kimchi is such a good combination of flavors all while being cheap as hell to make. What's even better is when you put cheese on top of the fried rice if you're willing to forego being a traditionalist snob. Don't knock it until you try it, because cheese, spam, and kimchi fried rice is the pinnacle of fusion food done right.<br/><br/>We ate this fried rice with some leftover roasted vegetables (broccoli, mushrooms, onions, zucchini) and some tofu with tomatoes. It can go with pretty much anything, really."
},
{"id" : "6",
 "name":"Miscelanea",
 "date":"February 16, 2019",
 "cuisine": "Mexican",
 "finalscore": "★ 10/10",
 "address": "63 E 4th St, New York, NY 10003",
 "ratings":"★★★★★",
 "ratings2":"★★★★★",
 "link":"https://miscelaneany.com/pages/take-out-and-coffee-drinks",
 "type":"restaurant",
 "descriptions": "The tortas here are amazing and the bread is freshly baked. Most bodegas that sell sandwiches will toast their bread really hard or use some baguettes that destroy the upper pallet of your mouth, but this bread was warm, fluffy, yet crisp on the outside without being too rough. The chorizo torta was a great brunch option with that fried egg, but the Picadillo torta was even more amazing with the seasoned ground beef, avocado, caramelized onions, and grilled oaxaca cheese. The pickled vegetables and tortilla chips that came with the meal were perfect compliments to the heaviness of the meat.<br/> <br/>This place also offered free gum, grasshopper samples, and had their homemade aguas frescas which was a refreshing combination of tamarind, chili, and mango. Overall, this was a great place for brunch, with the only knock being that it was too small of a place and had roughly 4 seats overall."
},
{"id" : "7",
 "name":"Jeju Noodle Bar",
 "date":"February 16, 2019",
 "cuisine": "Korean",
 "finalscore": "★ 10/10",
 "address": "679 Greenwich St. New York, NY 10014",
 "ratings":"★★★★★",
 "ratings2":"★★★★★",
 "link":"https://jejunoodlebar.com/#Menu",
 "type":"restaurant",
 "descriptions": "This 2019 Michelin Star restaurant did not disappoint. For appetizers, the chicken wings were hot, crispy, and juicy with the pickled vegetables being a perfect compliment. The Tuna Yuk Hue was a light and refreshing appetizer with cucumber kimchi, roasted marcona almonds, toasted seaweed, and sesame soy sauce drizzled all over the bits of fatty tuna. <br/> <br/> The So Ramen was clearly the star of the show, with the raw veal cooking in the broth and adding an extra dimension to the garlicky broth. It was probably the richest ramen broth I've ever had, yet the flavors weren't overpowering at all. The Gochu Ramen was basically what you would expect ramen to taste like with a gochujang broth, and the pork belly was crispy yet tender on the inside." },
 {"id" : "8",
  "name":"English Breakfast",
  "date":"February 17, 2019",
  "cuisine": "English",
  "finalscore": "★ 7/10",
  "address": "Homemade Recipe",
  "ratings":"★★★★",
  "ratings2":"★★★",
  "link":"http://allrecipes.co.uk/recipe/32168/full-english-breakfast.aspx",
  "type":"recipe",
  "descriptions": "Apparently English breakfasts were made so that you wouldn't have to eat another meal for the entire day if you were on the road, which explains why this meal is so heavy. This breakfast was fun to make and the combination of baked beans and toast was a pleasant surprise to my Americanized tastebuds. There's nothing that screams amazing about this recipe, but it's good old greasy comfort food in a way that's kind of like your standard American bacon and eggs with hash browns, but with some <i>exotic</i> twists like fried tomatoes and baked beans. I would have loved to try some blood sausage too, but perhaps that will be for another day.<br/><br/> The New Yorkers in us decided to swap bagels for toast because we couldn't be assed to buy a whole loaf of bread if we were going to use roughly two to three slices. But if you're in New York City, why not use a bagel instead? It's damn near impossible to find a shitty bagel in the city."
},
{"id" : "9",
 "name":"Angkor Cambodian Bistro",
 "date":"February 23, 2019",
 "cuisine": "Cambodian",
 "finalscore": "★ 8/10",
 "address": "408 E 64th St, New York, NY 10065",
 "ratings":"★★★★",
 "ratings2":"★★★★",
 "link":"https://www.angkornyc.com/menu-1",
 "type":"restaurant",
 "descriptions": "Reine's been trying to go to this place three times, and the third time was definitely the charm. Apart from the odd couple two tables apart from us, this place was cozy and welcoming for a Saturday brunch. The Khmer fish cakes were delicious with just the right amount of crispness and spiciness that you would want to compliment the fishy flavors from the patty. The Kuythiew was essentially the Cambodian version of Pad Thai and featured a lot more beansprouts and a type of rice noodle that was rounder and stringer than your usuall Pad Thai noodles. It was reminiscent of the type of noodle you would eat in a high-end instant noodle pack, but I mean that in the most endearing way. It was eggy, salty, sour, sweet, and everything that you would expect in a high quality Pad Thai. <br/><br/> The shrimp and avocado curry was a bit on the pricey side, but I guess that's the price you pay when those damn millennials are ruining Saturday brunches with their avocadoes. Jokes aside, avocado is surprisingly a great complement to red curry, and I'm glad it came out in chunks as opposed to being mashed into the sauce."
},
{"id" : "10",
 "name":"Parmesan Couscous",
 "date":"February 23, 2019",
 "cuisine": "American",
 "finalscore": "★ 9/10",
 "address": "Homemade Recipe",
 "ratings":"★★★★",
 "ratings2":"★★★★★",
 "link":"https://www.tasteofhome.com/recipes/parmesan-chicken-couscous/",
 "type":"recipe",
 "descriptions": "Couscous is simple to make and it's a great alternative to rice, noodles, or any other version of carbs. This particular version had toasted chopped walnuts, parmesan cheese, spinach, onions, and some leftover pork seasoned with oregano, black pepper, and thyme. I was pleasantly surprised at how this recipe turned out, and was clearly the star of the show when served alongside our rather lackluster ratatouille. Admittedly we did not use any parmesan in the creation of this recipe, but it was not needed whatsoever for a hearty meal. The lemon garlic flavors of this recipe really shone through, while the walnuts provided a satisfying crunch to an otherwise soft meal."
},
{"id" : "11",
 "name":"Ratatouille",
 "date":"February 24, 2019",
 "cuisine": "French",
 "finalscore": "★ 7/10",
 "address": "Homemade Recipe",
 "ratings":"★★★★",
 "ratings2":"★★★",
 "link":"https://www.allrecipes.com/recipe/18411/ratatouille/",
 "type":"recipe",
 "descriptions": "Not sure what the big deal is about ratatouille other than the fact that it's a movie, and that the rat's name is actually Remy. Maybe it's just because we aren't <b>sophisticated</b> enough to cook French cuisine, but these roast vegetables were time consuming and underwhelming. This isn't to say that this recipe is disgusting by any means; infact, tastewise the ratatouille turned out rather good. It's hard to mess up parmesan cheeese with vegetables in an oven. But our first attempt was a soupy mess most likely because our container wasn't wide enough for the vegetables to cook evenly. <br/> <br/> ...which led us to our second attempt, in which we used the cast iron skillet to fry the vegetables slowly so they would cook evenly. But at that point, we stopped using parmesan cheese because we ran out, and the food was rather bland. I guess you really can't improv on French cooking like you would in other styles, because there really wasn't a lot of seasoning or flavor added to this at all. It's just dependent on some rosemary, thyme, and perfectly cooked ingredients to get the job done, and I guess that's something us <i>amateur</i> chefs don't particularly shine with."
},
{"id" : "12",
 "name":"Garlic Parmesan Chicken Wings",
 "date":"February 24, 2019",
 "cuisine": "American",
 "finalscore": "★ 9/10",
 "address": "Homemade Recipe",
 "ratings":"★★★★★",
 "ratings2":"★★★★",
 "link":"https://www.allrecipes.com/recipe/231008/garlic-and-parmesan-chicken-wings/",
 "type":"recipe",
 "descriptions": "Garlic parmesan is a tried and true food pairing, especially with chicken wings. This recipe in particular called for the wings to be submerged in a seasoned bath of balsamic vinegar, which gave these wings a pleasant acidity to counteract the natural greasiness of the parmesan. The chili flakes also added an extra dimension of spice that elevated the wings into the 9 star category. <br/><br/> The parmesan crust made the wings extra crispy and everything clumped together into one big delicious mess, and the burnt bits on the tray tasted like gourmet Cheez Its. Overall, this was an amazing use of chicken wings and leftover parmesan cheese. This was paired with the ratatouille in day 2 of our attempt to create a decent version of the recipe, but this clearly outshined the main dish just like the parmesan couscous."
}
]
